In [136]:
import pandas as pd
import numpy as np
import pylab as plt
train = pd.read_csv('train.csv')

In [137]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [138]:
#Explore the types of datasets
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [139]:
train['Sex']=train['Sex'].astype('category')
cat_columns = train.select_dtypes(['category']).columns
train[cat_columns] = train[cat_columns].apply(lambda x: x.cat.codes)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35,0,0,373450,8.0500,NaN,S

In [140]:
train.head()
pclass_xt = pd.crosstab(train['Pclass'], train['Survived'])
pclass_xt

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [141]:
sex_xt = pd.crosstab(train['Sex'], train['Survived'])
sex_xt

Survived    0    1
Sex
0          81  233
1         468  109

In [142]:
# Observe that the majority of females survived on the ship
# Observe that the majority of the 1st class candidates survives

In [143]:
train['Embarked']=train['Embarked'].astype(str)
embarked_locs = (train['Embarked'].unique())
embarked_locs
embarked_locs_mapping = dict(zip(embarked_locs, 
                                 range(0, len(embarked_locs) + 1)))
embarked_locs_mapping

{'C': 1, 'Q': 2, 'S': 0, 'nan': 3}

In [144]:
train['Embarked_Val'] = train['Embarked'].map(embarked_locs_mapping).astype(int)

In [145]:

train['Embarked_Val'].value_counts()

0    644
1    168
2     77
3      2
Name: Embarked_Val, dtype: int64

In [146]:
if len(train[train['Embarked'].isnull()] > 0):
    train.replace({'Embarked_Val' : 
                   { embarked_locs_mapping['nan'] : 0
                   }
               }, 
               inplace=True)

In [147]:
Embarked_xt = pd.crosstab(train['Embarked_Val'], train['Survived'])
Embarked_xt

Survived        0    1
Embarked_Val
0             427  217
1              75   93
2              47   30
3               0    2

In [150]:
#display only those colums which have age as NAN
train[train['Age'].isnull()][['Sex', 'Pclass', 'Age']].head()

    Sex  Pclass  Age
5     1       3  NaN
17    1       2  NaN
19    0       3  NaN
26    1       3  NaN
28    0       3  NaN

In [156]:
# Filling the NAN value of age by respective median values of the sexes

train['AgeFill'] = train['Age']

train['AgeFill'] = train['AgeFill'].groupby([train['Sex'],train['Pclass']]).apply(lambda x: x.fillna(x.median()))

AttributeError: 'Series' object has no attribute 'isNull'

In [ ]:
# Feature Engimeering

train